Repository: abhinavm24/typewhisper-mac
Catalog: TypeWhisperPluginSDK/Plugins/ScriptPlugin/Localizable.xcstrings
Source language: en
Languages: de, ja, zh_hans

source: No rules configured.
de: Keine Regeln konfiguriert.
ja: ルールが設定されていません。
zh_hans: 尚未配置规则。

source: Active for all transcriptions.
de: Aktiv für alle Transkriptionen.
ja: すべてのテキスト転写に有効。
zh_hans: 对所有转录生效。

source: Add a script to process transcribed text via shell commands.
de: Füge ein Skript hinzu, um transkribierten Text per Shell-Befehl zu verarbeiten.
ja: スクリプトを追加して、シェルコマンドで転写テキストを処理します。
zh_hans: 添加脚本以通过 Shell 命令处理转录的文本。

source: Add Example
de: Beispiel hinzufügen
ja: 例を追加
zh_hans: 添加示例

source: Add Script
de: Skript hinzufügen
ja: スクリプトを追加
zh_hans: 添加脚本

source: Cancel
de: Abbrechen
ja: キャンセル
zh_hans: 取消

source: Command
de: Befehl
ja: コマンド
zh_hans: 命令

source: Done
de: Fertig
ja: 完了
zh_hans: 完成

source: Edit Script
de: Skript bearbeiten
ja: スクリプトを編集
zh_hans: 编辑脚本

source: Execution Log
de: Ausführungsprotokoll
ja: 実行ログ
zh_hans: 执行日志

source: General
de: Allgemein
ja: 一般
zh_hans: 通用

source: No profiles configured.
de: Keine Profile konfiguriert.
ja: 構成されたプロファイルはありません。
zh_hans: 未配置任何配置文件。

source: No Scripts
de: Keine Skripte
ja: スクリプトなし
zh_hans: 无脚本

source: Only active for selected profiles.
de: Nur aktiv für ausgewählte Profile.
ja: 選択したプロファイルのみに有効。
zh_hans: 仅对选定的配置文件生效。

source: Profiles
de: Profile
ja: プロファイル
zh_hans: 配置文件

source: Save
de: Sichern
ja: 保存
zh_hans: 保存

source: Script Runner
de: Skript-Runner
ja: スクリプトランナー
zh_hans: 脚本运行器

source: Text is passed via stdin. Return result via stdout.
de: Text wird über stdin übergeben. Ergebnis über stdout zurückgeben.
ja: テキストはstdin経由で渡され、結果はstdout経由で返されます。
zh_hans: 文本通过 stdin 传入，结果通过 stdout 返回。

source: Also run for completed Recorder transcripts
de: Auch für fertige Recorder-Transkripte ausführen
ja: レコーダーの完成した文字起こしにも実行
zh_hans: 录音器转录完成后也运行脚本

source: Recordings
de: Aufnahmen
ja: 録音
zh_hans: 录音

source: Runs after saving, including retranscriptions. Receives the transcript via stdin and file paths via environment variables. Output does not change the saved transcript. Independent of rule filters.
de: Wird nach dem Speichern ausgeführt, auch bei erneuter Transkription. Erhält das Transkript über stdin und Dateipfade über Umgebungsvariablen. Die Ausgabe verändert das gespeicherte Transkript nicht. Unabhängig von Regelfiltern.
ja: 保存後に実行します。再文字起こしも対象です。文字起こしは標準入力、ファイルパスは環境変数で渡されます。出力は保存済み文字起こしを変更しません。ルールフィルターとは独立しています。
zh_hans: 保存后执行，包括重新转录。通过标准输入接收转录文本，通过环境变量接收文件路径。输出不会更改已保存的转录。不受规则筛选条件影响。

source: Name
ja: 名前
zh_hans: 名称
